[
  {
    "book_type_name": "Light Novel",
    "author_name": "Saekisan",
    "title": "The Angel Next Door Spoils Me Rotten",
    "price": 9.23,
    "sypnosis": "Amane lives alone in an apartment, and the most beautiful girl in school, Mahiru, lives just next door. They've almost never spoken-until the day he sees her in distress on a rainy day and lends her his umbrella. To return the favor, she offers him help around the house, and a relationship slowly begins to blossom as the distance between them closes...",
    "book_image": "https://rimg.bookwalker.jp/5702704/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Romance, School Life, Slice of Life",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": true,
    "number_of_pages": 222,
    "book_slug": "the-angel-next-door-spoils-me-rotten"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Rifujin na Maganote",
    "title": "Mushoku Tensei: Jobless Reincarnation",
    "price": 4.81,
    "sypnosis": "DEATH IS ONLY THE BEGINNING! - Kicked out by his family and wandering the streets, an unemployed 34-year-old shut-in thinks he's hit rock-bottom--just as he's hit and killed by a speeding truck! Awakening to find himself reborn as an infant in a world of swords and sorcery, but with the memories of his first life intact, Rudeus Greyrat is determined not to repeat his past mistakes. He's going to make the most of this reincarnation as he sets off on the adventure of a second lifetime!",
    "book_image": "https://rimg.bookwalker.jp/3687823/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Comedy, Drama, Ecchi, Fantasy, Harem, Mature, Romance, Seinen, Tragedy",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Seven Seas Entertainment",
    "is_bestseller": true,
    "number_of_pages": 402,
    "book_slug": "mushoku-tensei-jobless-reincarnation"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Kumo Kagyu",
    "title": "Goblin Slayer",
    "price": 8.27,
    "sypnosis": "A young priestess has formed her first adventuring party, but almost immediately they find themselves in distress. It's the Goblin Slayer who comes to their rescue--a man who's dedicated his life to the extermination of all goblins, by any means necessary. And when rumors of his feats begin to circulate, there's no telling who might come calling next...",
    "book_image": "https://rimg.bookwalker.jp/9298922/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Fantasy, Harem, Mature, Seinen, Tragedy",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 264,
    "book_slug": "goblin-slayer"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Isuna Hasekura",
    "title": "Spice and Wolf",
    "price": 8.27,
    "sypnosis": "The life of a traveling merchant is a lonely one, a fact with which Kraft Lawrence is well acquainted. Wandering from town to town with just his horse, cart, and whatever wares have come his way, the peddler has pretty well settled into his routine-that is, until the night Lawrence finds a wolf goddess asleep in his cart. Taking the form of a fetching girl with wolf ears and a tail, Holo has wearied of tending to harvests in the countryside and strikes up a bargain with the merchant to lend him the cunning of \"Holo the Wisewolf\" to increase his profits in exchange for taking her along on his travels. What kind of businessman could turn down such an offer? Lawrence soon learns, though, that having an ancient goddess as a traveling companion can be a bit of a mixed blessing. Will this wolf girl turn out to be too wild to tame?",
    "book_image": "https://rimg.bookwalker.jp/3831822/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Adventure, Drama, Fantasy, Romance, Seinen, Slice of Life",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": true,
    "number_of_pages": 215,
    "book_slug": "spice-and-wolf"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Asato Asato",
    "title": "86--Eighty-Six",
    "price": 8.27,
    "sypnosis": "A War Without Casualties\n\nThe Republic of San Magnolia has long been under attack from the neighboring Giadian Empire's army of unmanned drones known as the Legion. After years of painstaking research, the Republic finally developed autonomous drones of their own, turning the one-sided struggle into a war without casualties-or at least, that's what the government claims. In truth, there is no such thing as a bloodless war. Beyond the fortified walls protecting the eighty-five Republic territories lies the \"\"nonexistent\"\" Eighty-Sixth Sector. The young men and women of this forsaken land are branded the Eighty-Six and, stripped of their humanity, pilot the \"\"unmanned\"\" weapons into battle...",
    "book_image": "https://rimg.bookwalker.jp/0251923/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Drama, Mecha, Romance, Sci-fi, Seinen, Supernatural, Tragedy",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 276,
    "book_slug": "86-eighty-six"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Nozomu Mochitsuki",
    "title": "Tearmoon Empire",
    "price": 7.94,
    "sypnosis": "Mia, hated princess of the fallen Tearmoon Empire, is executed by guillotine...\nAnd wakes up a kid again! With this second chance she resolves to fix the ailing Empire.\nCan Mia change history and save her own skin? Maybe with some much-needed help!\n\nSurrounded by the hate-filled gazes of her people, the selfish princess of the fallen Tearmoon Empire, Mia, takes one last look at the bleeding sun before the guillotine blade falls...\nOnly to wake back up as a twelve-year-old! With time rewound and a second chance at life dropped into her lap, she sets out to right the countless wrongs that plague the ailing Empire. Corrupt governance? Check. Border troubles? Check. Natural calamities and economic strife? Check.\nMy, seems like a lot of work.\nHard work and Mia don't mix, so she seeks out the aid of others, starting with her loyal maid, Anne, and the brilliant minister, Ludwig. Together, they strive day and night to restore the Empire. Little by little, their tireless efforts begin to change the course of history, pushing the whole of the continent toward a new future.\nAnd why did the selfish princess have a change of heart, you ask? Simple--she didn't. She's just terrified of the guillotine. They hurt like hell, and Mia hates pain more than work.\nLazy, selfish, and a complete coward, the ill-equipped princess of the Tearmoon Empire, armed with memories of her past life and a diary from the future, tries to avoid dying at the guillotine again and changes the very course of history in the process!",
    "book_image": "https://rimg.bookwalker.jp/0606263/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Drama, Fantasy, Romance, Shoujo, Tragedy",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "J-Novel Club",
    "is_bestseller": false,
    "number_of_pages": 304,
    "book_slug": "tearmoon-empire"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Yukiya Murasaki",
    "title": "Altina the Sword Princess",
    "price": 7.94,
    "sypnosis": "Banished to the borderlands, inept soldier Regis Aurick is found by the daring Princess Altina for his rumored strategic prowess. She aspires to reform a corrupt empire, but must first prove her worth--both to her soldiers and her would-be tactician.\n\nInept with a sword, unable to ride a horse, and apathetic toward the empire he serves, Regis Aurick is a hopeless soldier who spends his days buried in books. Banished to the borderlands, he encounters a stirring young woman with red hair and ruby eyes. She is Fourth Princess Marie Quatre Argentina de Belgaria, known simply to Regis as Altina. “…Do you want to become my tactician or not?” Having sought him for his rumored strategic prowess, she aspires to reform an empire led by self-seeking nobles and driven to pointless wars, the legendary blade of an emperor, the Grand Tonnerre Quatre, at her hip. Continuously underestimated by her regiment, including her would-be tactician, the princess resolves to prove her worth beyond a shadow of a doubt--no matter the risk. Here is a tale of war, love, and politics, woven by the bookworm and the sword princess.",
    "book_image": "https://rimg.bookwalker.jp/9018353/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Drama, Fantasy Harem, Martial Arts, Romance, Shounen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "J-Novel Club",
    "is_bestseller": false,
    "number_of_pages": 193,
    "book_slug": "altina-the-sword-princess"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Hiro Ainana",
    "title": "Death March to the Parallel World Rhapsody",
    "price": 8.27,
    "sypnosis": "Suzuki, an adult programmer, suddenly noticed that he was thrown into another world wearing casual clothes at level 1. He gained a high level and many treasures after using the 3-times-use disposable magic, Meteor Shower, once. After that he intends to do another world “sightseeing tour”?\n\nHe meets three beast-kin girls, beautiful purple and black-haired sisters and an eccentric blonde-haired elf girl, along with various people during his trip. Although occasionally fighting demons and demon lords, this is a heartwarming fantasy story at heart",
    "book_image": "https://rimg.bookwalker.jp/9195232/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Comedy, Fantasy, Harem, Shounen, Slice of Life",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 240,
    "book_slug": "death-march-to-the-parallel-world-rhapsody"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Miya Kazuki",
    "title": "Ascendance of a Bookworm",
    "price": 7.94,
    "sypnosis": "A young woman who loves books dies and is reborn in another world as Myne, a sickly child from a poor family. Worst of all, there are almost no books in this world! So Myne decides that she'll just have to make her own and become a librarian.\n\nA certain college girl who's loved books ever since she was a little girl dies in an accident and is reborn in another world she knows nothing about. She is now Myne, the sickly five-year-old daughter of a poor soldier. To make things worse, the world she's been reborn in has a very low literacy rate and books mostly don't exist. She'd have to pay an enormous amount of money to buy one.",
    "book_image": "https://rimg.bookwalker.jp/3724233/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Adventure, Comedy, Drama, Fantasy, Shoujo, Slice of Life, Supernatural",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "J-Novel Club",
    "is_bestseller": false,
    "number_of_pages": 280,
    "book_slug": "ascendance-of-a-bookworm"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "FUSE",
    "title": "That Time I Got Reincarnated as a Slime",
    "price": 8.27,
    "sypnosis": "A man is stabbed by a robber on the run after pushing his coworker and his coworker’s new fiance out of the way. As he lays dying, bleeding on the ground, he hears a voice. This voice is strange and interprets his dying regret of being a virgin by giving him the [Great Sage] unique skill! Is he being made fun of?!!",
    "book_image": "https://rimg.bookwalker.jp/6277772/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Comedy, Fantasy, Martial Arts, Shounen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 304,
    "book_slug": "that-time-i-got-reincarnated-as-a-slime"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Okina Baba",
    "title": "So I'm a Spider, So What?",
    "price": 8.27,
    "sypnosis": "The world where the Hero and the Demon King continue to oppose each other. The grand magic from the Hero and the Demon King cross over worlds and exploded in the classroom of a certain high school.\n\nThe students who died in the explosion will be reincarnated in a different world. The protagonist, who had the lowest reputation in the class, was reincarnated into a spider. Nevertheless, she adapted quickly to the present condition with strong willpower.\n\nThis is a story of she who has become a spider trying whatever she can to live.",
    "book_image": "https://rimg.bookwalker.jp/7126372/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Comedy, Drama, Fantasy, Mystery, Sci-fi, Seinen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 285,
    "book_slug": "so-im-a-spider-so-what"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Kiyotaka Haimura",
    "title": "A Certain Magical Index",
    "price": 8.27,
    "sypnosis": "A certain unlikely hero...Touma Kamijou has the worst luck imaginable... Sure he's a citizen of Academy City, a scientific marvel of the modern world where superhuman abilities are artificially cultivated and commonplace, but when it comes to paranormal talent, Kamijou's been classified a Level Zero-a loser, basically. Oh, he does have one trick up his sleeve (literally), but even that's more trouble than it's worth.When Kamijou encounters a delusional young girl convinced she's a nun and raving about being chased by evil sorcerers, he's eager to send her on her way and get back to failing his studies. Fate, it would seem though, has other ideas, and he suddenly finds himself caught up in a supernatural intrigue with a girl named \"\"Index\"\" at the center!Science and magic collide in this first volume of one of the most popular light novel series ever penned!",
    "book_image": "https://rimg.bookwalker.jp/6412172/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Comedy, Drama, Fantasy, Harem, Romance, Sci-fi, Shounen, Supernatural",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 235,
    "book_slug": "a-certain-magical-index"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Eiji Mikage",
    "title": "The Empty Box and Zeroth Maria",
    "price": 8.27,
    "sypnosis": "Kazuki Hoshino treasures nothing more than his ordinary life, and March 2 should have been an ordinary day. The arrival of a transfer student, the mysterious Aya Otonashi, shouldn't have shattered the world he knows. He's never seen this girl before in his life, but she says she's met him thousands of times--and declares war on him for a crime he can't even remember... As the truth begins to unravel, nothing is as it seems, and at the heart of it all is a wish powerful enough to change everything...",
    "book_image": "https://rimg.bookwalker.jp/3139782/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Drama, Horror, Mystery, Psychological, Romance, School Life, Seinen, Supernatural, Tragedy",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 228,
    "book_slug": "the-empty-box-and-zeroth-maria"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Jougi Shiraishi",
    "title": "Wandering Witch: The Journey of Elaina",
    "price": 8.27,
    "sypnosis": "It's not about the destination...What's your favorite story? Does it have a hero who slays a dragon and saves a princess? Or a child of prophecy destined for greatness? Well, my favorite story is a little different. It's the tale of a witch who travels the world, seeking nothing in particular. With no quest of her own, she's free to wander wherever the wind takes her, adding a few pages to the story of whomever she meets before setting off on her next adventure. At the end of her travels, the witch takes on an apprentice who will one day begin her own journey. And so the cycle continues, or so the story goes. Now, the witch who starts the story anew...who could she be?",
    "book_image": "https://rimg.bookwalker.jp/6729463/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Adventure, Comedy, Fantasy, Slice of Life, Tragedy",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 234,
    "book_slug": "wandering-witch-the-journey-of-elaina"
  },
  {
    "book_type_name": "Light Novel",
    "author_name": "Wataru Watari",
    "title": "My Youth Romantic Comedy is Wrong, As Expected",
    "price": 8.27,
    "sypnosis": "Hachiman Hikigaya is a cynic. \"\"Youth\"\" is a crock, he believes--a sucker's game, an illusion woven from failure and hypocrisy. But when he turns in an essay for a school assignment espousing this view, he's sentenced to work in the Service Club, an organization dedicated to helping students with problems in their lives! How will Hachiman the Cynic cope with a job that requires--gasp!--optimism?",
    "book_image": "https://rimg.bookwalker.jp/6469043/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Drama, Psychological, Romance, School Life, Seinen, Slice of Life",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Yen On",
    "is_bestseller": false,
    "number_of_pages": 238,
    "book_slug": "my-youth-romantic-comedy-is-wrong-as-expected"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Yoshitoki Oima",
    "title": "To Your Eternity",
    "price": 11.76,
    "sypnosis": "An immortal being was sent to the surface of the earth and met a boy living alone in the middle of tundra. The being can take the shape of dying things, but only if the \"impetus\" is stronger than the previous one. What sort of experiences and meetings will the being encounter while living forever?",
    "book_image": "https://rimg.bookwalker.jp/1637304/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Adventure, Drama, Fantasy, Shounen, Supernatural, Reincarnation",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": true,
    "number_of_pages": 198,
    "book_slug": "to-your-eternity"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Naoki Yamakawa",
    "title": "I'm Standing on a Million Lives",
    "price": 10.68,
    "sypnosis": "Yotsuya Yuusuke along with his classmates Shindou Lu and Hakozaki Kusue have been transported to a strange and unknown world inhabited by mythological creatures. As soon as they arrive, they meet somebody calling himself the Game Master who then grants them a time-limited quest. To aid them in this quest, he also bestows Shindou and Hakozaki with the roles of a Magician and a Warrior while Yotsuya is randomly granted the role of... a Farmer?! This is how a hectic life of adventuring began for three students who now have no choice but to complete random quests for several phases in the fantasy world if they want to stay alive and protect the real world from the demons and monsters they encounter.",
    "book_image": "https://rimg.bookwalker.jp/4387103/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Comedy, Drama, Fantasy, Romance, Shounen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": false,
    "number_of_pages": 194,
    "book_slug": "im-standing-on-a-million-lives"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Hajime Isayama",
    "title": "Attack on Titan",
    "price": 10.68,
    "sypnosis": "In a world entirely ruled by giants, the human race, which has turned into their food, has surrounded its residential zones with immense walls, which both prevent their freedom outside the walls and protect them from incursions. However, as a result of the appearance of supergiants who cross the wall, a desperate struggle begins and the young heroes, who have lost their parents, fight the giant as a training corps, with a view to regaining their freedom.\n\nNote: Won the Kodansha Manga Award in the shōnen category in 2011, was nominated for the 4th annual Manga Taishō award and also for the the 16th and 18th annual Tezuka Osamu Cultural Prize.",
    "book_image": "https://rimg.bookwalker.jp/2694222/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Drama, Fantasy, Horror, Mystery, Shounen, Supernatural, Tragedy, Award winning, Gore, Survival",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": true,
    "number_of_pages": 196,
    "book_slug": "attack-on-titan"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Yukimura Makoto",
    "title": "Vinland Saga",
    "price": 19.25,
    "sypnosis": "As a child, Thorfinn sat at the feet of the great Leif Ericson and thrilled to wild tales of a land far to the west. But his youthful fantasies were shattered by a mercenary raid. Raised by the Vikings who murdered his family, Thorfinn became a terrifying warrior, forever seeking to kill the band's leader, Askeladd, and avenge his father. Sustaining Thorfinn through his ordeal are his pride in his family and his dreams of a fertile westward land, a land without war or slavery... the land Leif called Vinland.\n\nNote: Was nominated for the 2008 Manga Taisho award. Won the Grand Prize in the manga division of the Japan Media Arts awards in 2009. Won the 36th Kodansha Manga Award for Best General Manga in 2012.",
    "book_image": "https://rimg.bookwalker.jp/6035222/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Adventure, Drama, Historical, Psychological, Seinen, Award winning, Gore",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": false,
    "number_of_pages": 472,
    "book_slug": "vinland-saga"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Wataru Akashingo",
    "title": "My Dad is the Queen of all Vtubers?!",
    "price": 9.73,
    "sypnosis": "The highschooler Takashi, a fan of the beautiful VTuber girl Kizuke Yai, discovers the shocking truth that his beloved father has been the real person behind Kizuke Yai all along! Furthermore, even his mother has secrets of her own...!? The end of father/son conflict over the world wide web? Super-popular high-tension comedy!!",
    "book_image": "https://rimg.bookwalker.jp/5855983/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Slice of Life, Seinen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kaiten Books",
    "is_bestseller": false,
    "number_of_pages": 156,
    "book_slug": "my-dad-is-the-queen-of-all-vtubers"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Carlo Zen",
    "title": "The Saga of Tanya the Evil",
    "price": 7.39,
    "sypnosis": "A young girl fights on the frontlines in war. She has blonde hair, blue eyes, and nearly transparent white skin as she flies through the air and mercilessly strikes down her enemies. Her name is Tanya Degurechov and speaks with a young girl's lisp while she commands the army. Tanya used to be one of Japan's elite office workers, but because of a wrathful god was reborn as a little girl. Prioritizing optimization and career advancement above all, she will become the most dangerous entity among the Imperial Army's sorcerers.",
    "book_image": "https://rimg.bookwalker.jp/7413482/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Drama, Fantasy, Seinen, Isekai, Gender Bender, Reincarnation, Loli",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen Press",
    "is_bestseller": true,
    "number_of_pages": 166,
    "book_slug": "the-saga-of-tanya-the-evil"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Nakatani Nio",
    "title": "Bloom into You",
    "price": 9.73,
    "sypnosis": "Yuu has just begun her first year in high school but has still not yet responded to a middle school graduation confession by a boy who she has always liked, but who's confession did not excite her. Yuu loves shoujo manga and she knew how confessions were supposed to feel, but she didn't feel it and she has not found a way to respond to him in months. Yuu then sees Nanami the student council president turning down a confession very thoughtfully. Yuu later discovers that Nanami has never accepted a confession because none made her feel something. Inspired by Nanami's honesty and their likemindedness, Yuu consults Nanami, but after helping her, Nanami confesses to Yuu!?",
    "book_image": "https://rimg.bookwalker.jp/3912362/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Drama, Romance, School Life, Shoujo Ai, Slice of Life",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Seven Seas Entertainment",
    "is_bestseller": false,
    "number_of_pages": 188,
    "book_slug": "bloom-into-you"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Itagaki Hako, Teshima Fuminori",
    "title": "An Archdemon's Dilemma: How to Love Your Elf Bride",
    "price": 9.63,
    "sypnosis": "Zagan is feared as an evil mage, he is awkward and has a sharp tongue, and once again had to put down thieves that encroached on his territory when he researching that morning. In a dark auction, he finds a white slave elf, Nephie, who holds a peerless beauty. Falling in love with her at first sight, he uses his fortune to buy her, but as poor as he is socially, doesn't understand how to connect with her. Thus, the clumsy cohabitation of the mage that can't convey his love, and the slave that pines for her master but doesn't understand how to bring it up, begins.",
    "book_image": "https://rimg.bookwalker.jp/0992933/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Fantasy, Romance, Shounen, Slice of Life, Supernatural",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "J-Novel Club",
    "is_bestseller": false,
    "number_of_pages": 149,
    "book_slug": "an-archdemons-dilemma-how-to-love-your-elf-bride"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Miyajima Reiji",
    "title": "Rent-A-Girlfriend",
    "price": 11.76,
    "sypnosis": "Kinoshita Kazuya is a regular college student who was just dumped by his girlfriend for another guy. Feeling down in the dumps, he decides to use an app called Diamond to hire Mizuhara Chizuru, a rental girlfriend, to make himself feel better. From their first meeting, she seems to be the perfect girl for him, but is there more to her than meets the eye? And how will their not quite typical relationship develop?",
    "book_image": "https://rimg.bookwalker.jp/1848183/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Romance, School Life, Shounen, Drama",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": false,
    "number_of_pages": 211,
    "book_slug": "rent-a-girlfriend"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Toboso Yana",
    "title": "Black Butler",
    "price": 7.39,
    "sypnosis": "Just a stone´s throw from London lies the manor house of the illustrious Phantomhive earldom and its master, one Ciel Phantomhive. Earl Phantomhive is a giant in the world of commerce, Queen Victorias faithful servant and a slip of a twelve-year-old boy.\n\nFortunately his loyal butler Sebastian is ever at his side, ready to carry out the young masters wishes. And whether Sebastian is called to save a dinner party gone awry or probe the dark secrets of Londons underbelly, there apparently is nothing Sebastian cannot do. In fact, one might even say Sebastian is too good to be true or at least, too good to be human.",
    "book_image": "https://rimg.bookwalker.jp/6076902/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Comedy, Drama, Historical, Mystery, Shounen, Supernatural",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen Press",
    "is_bestseller": false,
    "number_of_pages": 198,
    "book_slug": "black-butler"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Kaneda Yousuke",
    "title": "Boarding School Juliet",
    "price": 10.68,
    "sypnosis": "\"To Love, or not to Love\"\n\nJuliet Percia and Inudzuka Romeo are archenemies. They lead two high-school dormitories the \"Black Dogs\" and the \"White Cats\" from two rivalling countries. Both factions are dead set on defeating the other to gain control over the island they have to share. Beneath the feuding exterior, however, Percia and Inudzuka long for love and peace for their budding relationship...",
    "book_image": "https://rimg.bookwalker.jp/1021392/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Action, Comedy, Ecchi, Harem, Romance, School Life, Shounen",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": false,
    "number_of_pages": 194,
    "book_slug": "boarding-school-juliet"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Sankaku Head",
    "title": "Himouto! Umaru-chan",
    "price": 9.73,
    "sypnosis": "Behind closed doors, she's a completely different girl!\n\nTaihei's little sister Umaru is the picture of perfection: elegant, poised, and polite--not to mention drop-dead gorgeous, brilliant, and multitalented. She's the perfect high school girl who everybody envies and adores. What nobody knows is that this perfect little sister has a big secret!!",
    "book_image": "https://rimg.bookwalker.jp/8457492/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, School Life, Seinen, Slice of Life",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Seven Seas Entertainment",
    "is_bestseller": false,
    "number_of_pages": 190,
    "book_slug": "himouto-umaru-chan"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Saburouta",
    "title": "Citrus",
    "price": 9.73,
    "sypnosis": "From Yuri Project: Fashionable Yuzu imagined the first day at her new school she transferred to after her mother’s remarriage a bit differently; she didn’t know it’d be an ultra-strict and conservative girls’ school. So instead of a sweet high-school romance, she butts heads with the stern student council president Mei – who turns out to be her new step sister. And she has to learn that hate and love are often not that far apart.",
    "book_image": "https://rimg.bookwalker.jp/9417592/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Shoujo Ai, Yuri, Drama, Romance, School Life, Slice of Life",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Seven Seas Entertainment",
    "is_bestseller": false,
    "number_of_pages": 168,
    "book_slug": "citrus"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Yamamoto Souichirou",
    "title": "Teasing Master Takagi-san",
    "price": 7.39,
    "sypnosis": "\"If you blush, you lose.\"\n\nLiving by this principle, the middle schooler Nishikata gets constantly made fun of by his seat neighbor Takagi-san. With his pride shattered to pieces, he vows to turn the tables and get back at her some day.\n\nAnd so, he attempts to tease her day after day, only to find himself victim to Takagi-san's ridicule again sooner than later. Will he be able to make Takagi-san blush from embarrassment even once in the end?",
    "book_image": "https://rimg.bookwalker.jp/1908343/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Romance, School Life, Shounen, Slice of Life",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Yen Press",
    "is_bestseller": false,
    "number_of_pages": 162,
    "book_slug": "teasing-master-takagi-san"
  },
  {
    "book_type_name": "Manga",
    "author_name": "Musawo",
    "title": "Love and Lies",
    "price": 13.65,
    "sypnosis": "Lies are forbidden and love is doubly forbidden.\n\nIn the near future, when young people in Japan turn sixteen, they are assigned a marriage partner by the government. People don't have to go through the trouble of looking for someone, and everyone accepts that the country will find a compatible partner to make them happy.\n\nYukari Nejima is fifteen years old. He lives in a small corner of the country, and just can't seem to get ahead in life. Both academically and athletically he's below average. But in within him, he hides a heart burning with passion! In this world in which love is forbidden, what will happen to him when he falls in love?",
    "book_image": "https://rimg.bookwalker.jp/5463482/OWWPXNVne2Og5o9nA6tp3Q__.jpg",
    "genres": "Comedy, Drama, Romance, School Life, Shounen",
    "status": "Ongoing",
    "publish_date": "",
    "publishers": "Kodansha",
    "is_bestseller": false,
    "number_of_pages": 194,
    "book_slug": "love-and-lies"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Mitch Albom",
    "title": "The Five People You Meet in Heaven",
    "price": 6.50,
    "sypnosis": "From the author of the phenomenal #1 New York Times bestseller Tuesdays with Morrie, a novel that explores the unexpected connections of our lives, and the idea that heaven is more than a place; it's an answer.\n\nEddie is a wounded war veteran, an old man who has lived, in his mind, an uninspired life. His job is fixing rides at a seaside amusement park. On his 83rd birthday, a tragic accident kills him as he tries to save a little girl from a falling cart. He awakes in the afterlife, where he learns that heaven is not a destination. It's a place where your life is explained to you by five people, some of whom you knew, others who may have been strangers. One by one, from childhood to soldier to old age, Eddie's five people revisit their connections to him on earth, illuminating the mysteries of his \"meaningless\" life, and revealing the haunting secret behind the eternal question: \"Why was I here?\"",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388200541l/3431.jpg",
    "genres": "Fiction, Inspirational, Contemporary,  Fantasy, Classics, Adult, Spirituality, Adult Fiction, Philosophy, Novels",
    "status": "Completed",
    "publish_date": "2003",
    "publishers": "Hachette Books",
    "is_bestseller": false,
    "number_of_pages": 196,
    "book_slug": "the-five-people-you-meet-in-heaven"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Mitch Albom",
    "title": "The Magic Strings of Frankie Presto",
    "price": 6.00,
    "sypnosis": "Mitch Albom creates a magical world through his love of music in this remarkable new novel about the power of talent to change our lives\n\nThis is the epic story of Frankie Presto—the greatest guitar player who ever lived—and the six lives he changed with his six magical blue strings\n\nFrankie, born in a burning church, abandoned as an infant, and raised by a music teacher in a small Spanish town, until war rips his life apart. At nine years old, he is sent to America in the bottom of a boat. His only possession is an old guitar and six precious strings. His amazing journey weaves him through the musical landscape of the 1940s, ’50s and ’60s, with his stunning playing and singing talent affecting numerous stars (Duke Ellington, Hank Williams, Elvis Presley) until, as if predestined, he becomes a pop star himself.\n\nHe makes records. He is adored. But Frankie Presto’s gift is also his burden, as he realizes the power of the strings his teacher gave him, and how, through his music, he can actually affect people’s lives. At the height of his popularity, tortured by his biggest mistake, he vanishes. His legend grows. Only decades later, having finally healed his heart, does Frankie reappearjust before his spectacular death—to change one last life. With the Spirit of Music as our guide, we glimpse into the lives that were changed by one man whose strings could touch the music—and the magic—in each of us.",
    "book_image": "https://www.mitchalbom.com/wp-content/uploads/2015/07/frankie_final-cover_small.jpg",
    "genres": "Fiction, Historical, Historical Fiction, Music, Audiobook, Magical Realism, Fantasy, Adult, Inspirational, Adult Fiction, Book Club",
    "status": "Completed",
    "publish_date": "2015",
    "publishers": "HarperCollins",
    "is_bestseller": true,
    "number_of_pages": 489,
    "book_slug": "the-magic-strings-of-frankie-presto"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "John Green",
    "title": "Looking for Alaska",
    "price": 6.35,
    "sypnosis": "Before. Miles “Pudge” Halter is done with his safe life at home. His whole life has been one big non-event, and his obsession with famous last words has only made him crave “the Great Perhaps” even more (Francois Rabelais, poet). He heads off to the sometimes crazy and anything-but-boring world of Culver Creek Boarding School, and his life becomes the opposite of safe. Because down the hall is Alaska Young. The gorgeous, clever, funny, sexy, self-destructive, screwed up, and utterly fascinating Alaska Young. She is an event unto herself. She pulls Pudge into her world, launches him into the Great Perhaps, and steals his heart. Then. . . .\nAfter. Nothing is ever the same.",
    "book_image": "https://d1w7fb2mkkr3kw.cloudfront.net/assets/images/book/lrg/9780/0075/9780007523160.jpg",
    "genres": "Young Adult, Fiction, Contemporary, Romance, Realistic Fiction, Coming Of Age, Teen, Mystery, Young Adult Contemporary, High School",
    "status": "Completed",
    "publish_date": "2005",
    "publishers": "Dutton Books",
    "is_bestseller": false,
    "number_of_pages": 221,
    "book_slug": "looking-for-alaska"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "John Green",
    "title": "The Fault in Our Stars",
    "price": 7.80,
    "sypnosis": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.\n\nInsightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
    "book_image": "https://upload.wikimedia.org/wikipedia/en/a/a9/The_Fault_in_Our_Stars.jpg",
    "genres": "Young Adult, Romance, Fiction, Contemporary, Realistic Fiction, Young Adult, Teen, Coming Of Age, Novels, Drama, Love",
    "status": "Completed",
    "publish_date": "2012",
    "publishers": "Dutton Books",
    "is_bestseller": false,
    "number_of_pages": 313,
    "book_slug": "the-fault-in-our-stars"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Suzanne Collins",
    "title": "The Hunger Games",
    "price": 5.99,
    "sypnosis": "Could you survive on your own in the wild, with every one out to make sure you don't live to see the morning?\n\nIn the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV.\n\nSixteen-year-old Katniss Everdeen, who lives alone with her mother and younger sister, regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before—and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weight survival against humanity and life against love.",
    "book_image": "https://upload.wikimedia.org/wikipedia/en/d/dc/The_Hunger_Games.jpg",
    "genres": "Young Adult, Fiction, Science Fiction, Dystopia, Fantasy, Romance, Adventure, Teen, Apocalyptic, Post Apocalyptic, Action",
    "status": "Completed",
    "publish_date": "2008",
    "publishers": "Scholastic Corporation",
    "is_bestseller": true,
    "number_of_pages": 374,
    "book_slug": "the-hunger-games"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Adam Silvera",
    "title": "They Both Die at the End",
    "price": 4.50,
    "sypnosis": "Adam Silvera reminds us that there’s no life without death and no love without loss in this devastating yet uplifting story about two people whose lives change over the course of one unforgettable day.\n\nOn September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today.\n\nMateo and Rufus are total strangers, but, for different reasons, they’re both looking to make a new friend on their End Day. The good news: There’s an app for that. It’s called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure—to live a lifetime in a single day.",
    "book_image": "https://img1.od-cdn.com/ImageType-400/0293-1/AA0/5D4/F9/%7BAA05D4F9-2E76-4C3B-BB40-81B8D2DAF178%7DImg400.jpg",
    "genres": "Young Adult, Contemporary, LGBT, Fiction, Romance, Audiobook, GLBT, Queer, Science Fiction, Fantasy, Young Adult Contemporary",
    "status": "Completed",
    "publish_date": "2017",
    "publishers": "HarperCollins",
    "is_bestseller": false,
    "number_of_pages": 389,
    "book_slug": "they-both-die-at-the-end"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "J.R.R. Tolkien",
    "title": "The Hobbit",
    "price": 6.80,
    "sypnosis": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort.\nWritten for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
    "book_image": "https://images-na.ssl-images-amazon.com/images/I/91b0C2YNSrL.jpg",
    "genres": "Classics, Fiction, Adventure, Young Adult, Science Fiction Fantasy, Fantasy, High Fantasy, Childrens, Epic Fantasy, Novels, Dragons",
    "status": "Completed",
    "publish_date": "1937",
    "publishers": "Allen & Unwin",
    "is_bestseller": true,
    "number_of_pages": 230,
    "book_slug": "the-hobbit"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Angie Thomas",
    "title": "The Hate U Give",
    "price": 7.00,
    "sypnosis": "Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.\n\nSoon afterward, his death is a national headline. Some are calling him a thug, maybe even a drug dealer and a gangbanger. Protesters are taking to the streets in Khalil’s name. Some cops and the local drug lord try to intimidate Starr and her family. What everyone wants to know is: what really went down that night? And the only person alive who can answer that is Starr.\n\nBut what Starr does—or does not—say could upend her community. It could also endanger her life.\n\nInspired by the Black Lives Matter movement, this is a powerful and gripping YA novel about one girl's struggle for justice.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1512391500l/36862147._SY475_.jpg",
    "genres": "Young Adult, Fiction, Contemporary, Audiobook, Realistic Fiction, Race, Social Movements, Social Justice, Young Adult, Teen, Young Adult Contemporary, African American",
    "status": "Completed",
    "publish_date": "2017",
    "publishers": "HarperCollins",
    "is_bestseller": false,
    "number_of_pages": 444,
    "book_slug": "the-hate-u-give"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Rainbow Rowell",
    "title": "Eleanor & Park",
    "price": 6.00,
    "sypnosis": "Eleanor is the new girl in town, and with her chaotic family life, her mismatched clothes and unruly red hair, she couldn't stick out more if she tried.\n\nPark is the boy at the back of the bus. Black T-shirts, headphones, head in a book - he thinks he's made himself invisible. But not to Eleanor... never to Eleanor.\n\nSlowly, steadily, through late-night conversations and an ever-growing stack of mix tapes, Eleanor and Park fall for each other. They fall in love the way you do the first time, when you're young, and you feel as if you have nothing and everything to lose.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1341952742l/15745753.jpg",
    "genres": "Young Adult, Romance, Contemporary, Fiction, Realistic Fiction, Audiobook, Young Adult, Teen, Coming Of Age, Young Adult Contemporary, High School",
    "status": "Completed",
    "publish_date": "2012",
    "publishers": "Orion Publishing Group",
    "is_bestseller": false,
    "number_of_pages": 328,
    "book_slug": "eleanor-and-park"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Matt Haig",
    "title": "The Midnight Library",
    "price": 7.50,
    "sypnosis": "Between life and death there is a library, and within that library, the shelves go on forever. Every book provides a chance to try another life you could have lived. To see how things would be if you had made other choices . . . Would you have done anything different, if you had the chance to undo your regrets?”\n\nA dazzling novel about all the choices that go into a life well lived, from the internationally bestselling author of Reasons to Stay Alive and How To Stop Time.\n\nSomewhere out beyond the edge of the universe there is a library that contains an infinite number of books, each one the story of another reality. One tells the story of your life as it is, along with another book for the other life you could have lived if you had made a different choice at any point in your life. While we all wonder how our lives might have been, what if you had the chance to go to the library and see for yourself? Would any of these other lives truly be better?\n\nIn The Midnight Library, Matt Haig’s enchanting new novel, Nora Seed finds herself faced with this decision. Faced with the possibility of changing her life for a new one, following a different career, undoing old breakups, realizing her dreams of becoming a glaciologist; she must search within herself as she travels through the Midnight Library to decide what is truly fulfilling in life, and what makes it worth living in the first place.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1602190253l/52578297.jpg",
    "genres": "Fiction, Fantasy, Contemporary, Audiobook, Magical Realism, Adult, Science Fiction, Health, Mental Health, Writing, Books About Books, Adult Fiction",
    "status": "Completed",
    "publish_date": "2020",
    "publishers": "Viking Press",
    "is_bestseller": false,
    "number_of_pages": 288,
    "book_slug": "the-midnight-library"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Kiley Reid",
    "title": "Such a Fun Age",
    "price": 6.80,
    "sypnosis": "A striking and surprising debut novel from an exhilarating new voice, Such a Fun Age is a page-turning and big-hearted story about race and privilege, set around a young black babysitter, her well-intentioned employer, and a surprising connection that threatens to undo them both.\n\nAlix Chamberlain is a woman who gets what she wants and has made a living, with her confidence-driven brand, showing other women how to do the same. So she is shocked when her babysitter, Emira Tucker, is confronted while watching the Chamberlains' toddler one night, walking the aisles of their local high-end supermarket. The store's security guard, seeing a young black woman out late with a white child, accuses Emira of kidnapping two-year-old Briar. A small crowd gathers, a bystander films everything, and Emira is furious and humiliated. Alix resolves to make things right.\n\nBut Emira herself is aimless, broke, and wary of Alix's desire to help. At twenty-five, she is about to lose her health insurance and has no idea what to do with her life. When the video of Emira unearths someone from Alix's past, both women find themselves on a crash course that will upend everything they think they know about themselves, and each other.\n\nWith empathy and piercing social commentary, Such a Fun Age explores the stickiness of transactional relationships, what it means to make someone family, and the complicated reality of being a grown up. It is a searing debut for our times.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1557181911l/43923951._SY475_.jpg",
    "genres": "Fiction, Contemporary, Audiobook, Adult, Adult Fiction, Race, Literary Fiction, Novels, Book Club, Realistic Fiction",
    "status": "Completed",
    "publish_date": "2019",
    "publishers": "G.P. Putnam's Sons",
    "is_bestseller": false,
    "number_of_pages": 310,
    "book_slug": "such-a-fun-age"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Jeanine Cummins",
    "title": "American Dirt",
    "price": 7.00,
    "sypnosis": "También de este lado hay sueños.\nOn this side, too, there are dreams.\n\nLydia Quixano Pérez lives in the Mexican city of Acapulco. She runs a bookstore. She has a son, Luca, the love of her life, and a wonderful husband who is a journalist. And while there are cracks beginning to show in Acapulco because of the drug cartels, her life is, by and large, fairly comfortable.\n\nEven though she knows they’ll never sell, Lydia stocks some of her all-time favorite books in her store. And then one day a man enters the shop to browse and comes up to the register with a few books he would like to buy—two of them her favorites. Javier is erudite. He is charming. And, unbeknownst to Lydia, he is the jefe of the newest drug cartel that has gruesomely taken over the city. When Lydia’s husband’s tell-all profile of Javier is published, none of their lives will ever be the same.\n\nForced to flee, Lydia and eight-year-old Luca soon find themselves miles and worlds away from their comfortable middle-class existence. Instantly transformed into migrants, Lydia and Luca ride la bestia—trains that make their way north toward the United States, which is the only place Javier’s reach doesn’t extend. As they join the countless people trying to reach el norte, Lydia soon sees that everyone is running from something. But what exactly are they running to?",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1579793054l/50634450._SY475_.jpg",
    "genres": "Fiction, Contemporary, Audiobook, Historical, Historical Fiction, Book Club, Adult, Adult Fiction, Literary Fiction, Thriller, Novels",
    "status": "Completed",
    "publish_date": "2018",
    "publishers": "Macmillan Publishers",
    "is_bestseller": false,
    "number_of_pages": 459,
    "book_slug": "american-dirt"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Suzanne Redfearn",
    "title": "In An Instant",
    "price": 7.80,
    "sypnosis": "Life is over in an instant for sixteen-year-old Finn Miller when a devastating car accident tumbles her and ten others over the side of a mountain. Suspended between worlds, she watches helplessly as those she loves struggle to survive.\n\nImpossible choices are made, decisions that leave the survivors tormented with grief and regret. Unable to let go, Finn keeps vigil as they struggle to reclaim their shattered lives. Jack, her father, who seeks vengeance against the one person he can blame other than himself; her best friend, Mo, who bravely searches for the truth as the story of their survival is rewritten; her sister Chloe, who knows Finn lingers and yearns to join her; and her mother, Ann, who saved them all but is haunted by her decisions. Finn needs to move on, but how can she with her family still in pieces?",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1563893175l/44281326.jpg",
    "genres": "Fiction, Contemporary, Young Adult, Romance, Drama, Audiobook, Family, Adult, Novels, Adventure, Survival",
    "status": "Completed",
    "publish_date": "2020",
    "publishers": "Lake Union Publishing",
    "is_bestseller": false,
    "number_of_pages": 326,
    "book_slug": "in-an-instant"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Margarita Montimore",
    "title": "Oona Out of Order",
    "price": 6.35,
    "sypnosis": "A remarkably inventive novel that explores what it means to live a life fully in the moment, even if those moments are out of order.\n\nIt’s New Year’s Eve 1982, and Oona Lockhart has her whole life before her. At the stroke of midnight she will turn nineteen, and the year ahead promises to be one of consequence. Should she go to London to study economics, or remain at home in Brooklyn to pursue her passion for music and be with her boyfriend? As the countdown to the New Year begins, Oona faints and awakens thirty-two years in the future in her fifty-one-year-old body. Greeted by a friendly stranger in a beautiful house she’s told is her own, Oona learns that with each passing year she will leap to another age at random. And so begins Oona Out of Order...\n\nHopping through decades, pop culture fads, and much-needed stock tips, Oona is still a young woman on the inside but ever changing on the outside. Who will she be next year? Philanthropist? Club Kid? World traveler? Wife to a man she’s never met? Surprising, magical, and heart-wrenching, Margarita Montimore has crafted an unforgettable story about the burdens of time, the endurance of love, and the power of family.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1562010569l/45046893.jpg",
    "genres": "Fiction, Science Fiction, Time Travel, Contemporary, Audiobook, Magical Realism, Fantasy, Adult Fiction, Adult, Women's Fiction, Chick's Lit",
    "status": "Completed",
    "publish_date": "2020",
    "publishers": "Flatiron Books",
    "is_bestseller": false,
    "number_of_pages": 339,
    "book_slug": "oona-out-of-order"
  },
  {
    "book_type_name": "Western Novel",
    "author_name": "Jennifer L. Armentrout",
    "title": "From Blood and Ash",
    "price": 13.36,
    "sypnosis": "A Maiden\n\nChosen from birth to usher in a new era, Poppy’s life has never been her own. The life of the Maiden is solitary. Never to be touched. Never to be looked upon. Never to be spoken to. Never to experience pleasure. Waiting for the day of her Ascension, she would rather be with the guards, fighting back the evil that took her family, than preparing to be found worthy by the gods. But the choice has never been hers.\n\nA Duty\n\nThe entire kingdom’s future rests on Poppy’s shoulders, something she’s not even quite sure she wants for herself. Because a Maiden has a heart. And a soul. And longing. And when Hawke, a golden-eyed guard honor bound to ensure her Ascension, enters her life, destiny and duty become tangled with desire and need. He incites her anger, makes her question everything she believes in, and tempts her with the forbidden.\n\nA Kingdom\n\nForsaken by the gods and feared by mortals, a fallen kingdom is rising once more, determined to take back what they believe is theirs through violence and vengeance. And as the shadow of those cursed draws closer, the line between what is forbidden and what is right becomes blurred. Poppy is not only on the verge of losing her heart and being found unworthy by the gods, but also her life when every blood-soaked thread that holds her world together begins to unravel.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1588843906l/52861201._SY475_.jpg",
    "genres": "Fantasy, Romance, New Adult, Fantasy, Paranormal, Vampires, Young Adult, Fantasy Romance, Fiction, Adult, Paranormal Romance",
    "status": "Completed",
    "publish_date": "2020",
    "publishers": "Blue Box Press",
    "is_bestseller": false,
    "number_of_pages": 634,
    "book_slug": "from-blood-and-ash"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Peter Seibel",
    "title": "Coders at Work", 
    "price": 7.89,
    "sypnosis": "Peter Seibel interviews 16 of the most interesting computer programmers alive today in Coders at Work, offering a brand-new companion volume to Apress’s highly acclaimed best-seller Founders at Work by Jessica Livingston. As the words \"at work\" suggest, Peter Seibel focuses on how his interviewees tackle the day–to–day work of programming, while revealing much more, like how they became great programmers, how they recognize programming talent in others, and what kinds of problems they find most interesting.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1349026758l/6713575.jpg",
    "genres": "Computer Science, Programming, Nonfiction, Science, Computer Science, Technology, Software, Technical, Coding, Computers, Business, History",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Apress",
    "is_bestseller": true,
    "number_of_pages": 632,
    "book_slug": "coders-at-work"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Simon Singh",
    "title": "The Code Book",
    "price": 9.99,
    "sypnosis": "In his first book since the bestselling Fermat’s Enigma, Simon Singh offers the first sweeping history of encryption, tracing its evolution and revealing the dramatic effects codes have had on wars, nations, and individual lives. From Mary, Queen of Scots, trapped by her own code, to the Navajo Code Talkers who helped the Allies win World War II, to the incredible (and incredibly simple) logisitical breakthrough that made Internet commerce secure, The Code Book tells the story of the most powerful intellectual weapon ever known: secrecy.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1403181687l/17994.jpg",
    "genres": "Nonfiction, Science, History, Science, Mathematics, Computer Science, Technology, Popular Science, Computers, Microhistory, Spy Thriller, Espionage",
    "status": "Completed",
    "publish_date": "",
    "publishers": "HarperCollins, Doubleday",
    "is_bestseller": false,
    "number_of_pages": 412,
    "book_slug": "the-code-book"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Brian Christian",
    "title": "Algorithms to Live By",
    "price": 5.45,
    "sypnosis": "All our lives are constrained by limited space and time, limits that give rise to a particular set of problems. What should we do, or leave undone, in a day or a lifetime? How much messiness should we accept? What balance of new activities and familiar favorites is the most fulfilling? These may seem like uniquely human quandaries, but they are not: computers, too, face the same constraints, so computer scientists have been grappling with their version of such issues for decades. And the solutions they've found have much to teach us.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1454296875l/25666050.jpg",
    "genres": "Nonfiction, Science, Psychology, Computer Science, Technology, Self Help, Business, Programming, Philosophy, Audiobook",
    "status": "Completed",
    "publish_date": "",
    "publishers": "HarperCollins",
    "is_bestseller": true,
    "number_of_pages": 368,
    "book_slug": "algorithms-to-live-by"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Thomas H. Cormen", 
    "title": "Introduction to Algorithms", 
    "price": 10.50,
    "sypnosis": "This title covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers. Each chapter is relatively self-contained and can be used as a unit of study. The algorithms are described in English and in a pseudocode designed to be readable by anyone who has done a little programming. The explanations have been kept elementary without sacrificing depth of coverage or mathematical rigor.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1387741681l/108986.jpg",
    "genres": "Science, Computer Science, Programming, Algorithms, Reference, Technology, Nonfiction, Technical, Textbooks, Software",
    "status": "Completed",
    "publish_date": "",
    "publishers": "MIT Press",
    "is_bestseller": false,
    "number_of_pages": 1180,
    "book_slug": "introduction-to-algorithms"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Steve McConnell",
    "title": "Code Complete", 
    "price": 8.99,
    "sypnosis": "Widely considered one of the best practical guides to programming, Steve McConnell's original CODE COMPLETE has been helping developers write better software for more than a decade. Now this classic book has been fully updated and revised with leading-edge practices--and hundreds of new code samples--illustrating the art and science of software construction. Capturing the body of knowledge available from research, academia, and everyday commercial practice, McConnell synthesizes the most effective techniques and must-know principles into clear, pragmatic guidance.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1396837641l/4845.jpg",
    "genres": "Computer Science, Programming, Science, Technology, Software, Nonfiction, Technical, Coding, Computers, Reference, Engineering",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Microsoft Press",
    "is_bestseller": false,
    "number_of_pages": 914,
    "book_slug": "code-complete"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Scott Chacon",
    "title": "Pro Git",  
    "price": 5.65,
    "sypnosis": "Git is the version control system developed by Linus Torvalds for Linux kernel development. It took the open source world by storm since its inception in 2005, and is used by small development shops and giants like Google, Red Hat, and IBM, and of course many open source projects. A book by Git experts to turn you into a Git expert. Introduces the world of distributed version control Shows how to build a Git development workflow.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1383771684l/6518085.jpg",
    "genres": "Computer Science, Programming, Science, Technology, Nonfiction, Technical, Reference, Software, Computers, Coding, Engineering",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Apress",
    "is_bestseller": false,
    "number_of_pages": 290,
    "book_slug": "pro-git"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Ben Mezrich",
    "title": "The Accidental Billionaires", 
    "price": 8.99,
    "sypnosis": "Eduardo Saverin and Mark Zuckerberg - an awkward maths prodigy and a painfully shy computer genius - were never going to fit in at elite, polished Harvard. Yet that all changed when master-hacker Mark crashed the university's entire computer system by creating a rateable database of female students. Narrowly escaping expulsion, the two misfits refocused the site into something less controversial - 'The Facebook' - and watched as it spread like a wildfire across campuses around the country, along with their popularity.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1408923830l/7106938.jpg",
    "genres": "Nonfiction, Business, Biography, History, Science, Technology, Audiobook, Biography Memoir, Computer Science, Computers, Internet, Business, Entrepreneurship",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Doubleday",
    "is_bestseller": true,
    "number_of_pages": 255,
    "book_slug": "the-accidental-billionaires"
  },
  {
    "book_type_name": "Scholarly",
    "author_name": "Steven S. Skiena",
    "title": "The Algorithm Design Manual",  
    "price": 7.50,
    "sypnosis": "This volume helps take some of the \"mystery\" out of identifying and dealing with key algorithms. Drawing heavily on the author's own real-world experiences, the book stresses design and analysis. Coverage is divided into two parts, the first being a general guide to techniques for the design and analysis of computer algorithms. The second is a reference section, which includes a catalog of the 75 most important algorithmic problems. By browsing this catalog, readers can quickly identify what the problem they have encountered is called, what is known about it, and how they should proceed if they need to solve it.",
    "book_image": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1388183113l/425208.jpg",
    "genres": "Computer Science, Programming, Science, Algorithms, Technology, Technical, Nonfiction, Reference, Software, Computers",
    "status": "Completed",
    "publish_date": "",
    "publishers": "Springer",
    "is_bestseller": false,
    "number_of_pages": 486,
    "book_slug": "the-algorithm-design-manual"
  },
  {
    "title": "", 
    "price": "",
    "sypnosis": "",
    "book_image": "",
    "status": "Completed",
    "publish_date": "",
    "publishers": "",
    "is_bestseller": false,
    "number_of_pages": 0,
    "book_slug": ""
  }
]
